In [2]:
import pandas as pd

In [4]:
import numpy as np

In [9]:
df= pd.DataFrame(np.random.randn(4,3), index = ['a','b', 'c', 'd'], columns = ['x','y','z'])
print(df)

          x         y         z
a -1.186175  0.575176 -0.294366
b  0.619551 -1.011813  0.102221
c -0.152458  3.057358  0.159905
d  0.943168 -0.680893 -0.429351

In [10]:
df > 1

       x      y      z
a  False  False  False
b  False  False  False
c  False   True  False
d  False  False  False

In [12]:
# 불리언 메트릭스를 df에 또 넣으면 그부분만 마스킹이된다.
df[df >1]

    x         y   z
a NaN       NaN NaN
b NaN       NaN NaN
c NaN  3.057358 NaN
d NaN       NaN NaN

In [15]:
df[df['x'] > 0]

          x         y         z
b  0.619551 -1.011813  0.102221
d  0.943168 -0.680893 -0.429351

In [19]:
df[df['x'] > 0]['z']

b    0.102221
d   -0.429351
Name: z, dtype: float64

In [21]:
df

          x         y         z
a -1.186175  0.575176 -0.294366
b  0.619551 -1.011813  0.102221
c -0.152458  3.057358  0.159905
d  0.943168 -0.680893 -0.429351

In [24]:
df[(df['x'] > 0) | (df['y'] > 0)]

          x         y         z
a -1.186175  0.575176 -0.294366
b  0.619551 -1.011813  0.102221
c -0.152458  3.057358  0.159905
d  0.943168 -0.680893 -0.429351

In [26]:
data = {
    'Name': ['Alice','Bob','Charlie'],
    'Age' : [25,30,35],
    'City': ['New york', 'San Francisco', 'Los Angeles']
}
df = pd.DataFrame(data)

In [27]:
# concaternating dataframe
data1 = {
    'Name': ['Alice', 'Bob'],
    'Age' : [25,30]
}

data2 = {
    'Name': ['Charlie', 'David'],
    'Age': [35,40]
}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

#Concatenate DataFrames vertically
df_concatenated = pd.concat([df1, df2])
print(df_concatenated)

print("\n")

df_concatenated = pd.concat([df1, df2], ignore_index = True)
print(df_concatenated)

# 인덱스를 보면 ignore_index가 false인 부분은 0,1,0,1

      Name  Age
0    Alice   25
1      Bob   30
0  Charlie   35
1    David   40


      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40